app/controllers/searches_controller.rb

		def set_wine
			@wine = Wine.find_by_id params[:id]
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 7]]