app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
  	@user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL  ORDER BY "users"."id" ASC LIMIT 1
---
  def attempt_login
  	if params[:email].present? && params[:password].present?
  		found_user = User.where(email: params[:username]).first