app/controllers/wines_controller.rb

INSERT INTO "wines" ("name", "varietal", "vintage", "winery", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Test"], ["varietal", "Test"], ["vintage", "2012"], ["winery", "Spicy"], ["user_id", 2], ["created_at", "2015-08-05 23:05:05.611961"], ["updated_at", "2015-08-05 23:05:05.611961"]]
---
  def create
  	@wine = @user.wines.create wine_params

UPDATE "wines" SET "vintage" = $1, "updated_at" = $2 WHERE "wines"."id" = $3  [["vintage", "2015"], ["updated_at", "2015-08-06 00:10:21.971002"], ["id", 7]]
---
  def update
  	@wine.update wine_params

DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 5]]
---
  def destroy
  	@wine.destroy

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT 1  [["id", 7]]
---
  def set_wine
  	@wine = Wine.find_by_id params[:id]